better architecture diagram
